{
  "backend/main.mo": "Empty Motoko actor with no implemented functions.",
  "feature_evidence.json": "Report describing implemented frontend features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend source files.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining portal color scheme and dark mode settings.",
  "frontend/index.html": "HTML entry page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps pages in the PortalLayout with toast support.",
  "frontend/src/components/ChallanPreviewModal.tsx": "Modal showing challan details, fine calculation, proof image, and a simulated PDF download.",
  "frontend/src/components/EmptyState.tsx": "Simple empty-state component displaying a message with an icon.",
  "frontend/src/components/EvidenceSection.tsx": "Displays driver and road camera images with fallbacks when unavailable.",
  "frontend/src/components/LatestViolationCard.tsx": "Card highlighting the latest violation with proof image, details, and navigation actions.",
  "frontend/src/components/notifications/PopupNotifications.tsx": "Implements a global popup notification system with queueing, auto-dismiss, and manual close.",
  "frontend/src/components/PortalLayout.tsx": "Defines the main portal layout with header, navigation, footer, and popup notifications wrapper.",
  "frontend/src/components/PortalNav.tsx": "Renders top navigation with active route highlighting using TanStack Router.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, invalidating queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context and logic for managing Internet Identity login, state, and persistence.",
  "frontend/src/hooks/useInterval.ts": "Custom hook for running a callback on a recurring interval respecting React lifecycle.",
  "frontend/src/index.css": "Tailwind setup with custom color variables and government-themed utility classes.",
  "frontend/src/lib/api.ts": "Defines violation API types and fetch helpers, including a stub for challan data.",
  "frontend/src/lib/violations/images.ts": "Normalizes violation image URLs, ensuring absolute or prefixed localhost paths.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity provider.",
  "frontend/src/pages/ChallanManagementPage.tsx": "Fetches violations, groups them by vehicle, calculates fines, and displays challan management UI.",
  "frontend/src/pages/ChallanPreviewPage.tsx": "Loads a specific violation via query params, displays a challan preview with details and fine calculation, and supports PDF download simulation.",
  "frontend/src/pages/DashboardPage.tsx": "Shows the main dashboard with descriptive system overview and links to violations, challans, and safety compliance sections.",
  "frontend/src/pages/LiveViolationsPage.tsx": "Fetches and auto-refreshes violation data, detects new violations, triggers notifications, and displays a table with severity and challan modal support.",
  "frontend/src/pages/VehicleDetailsPage.tsx": "Displays violation history and owner details for a specific vehicle fetched via query params, with score calculation and error handling.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom color system, typography and container plugins, and responsive container settings.",
  "project_state.json": "Project metadata describing system purpose, requirements, architecture notes, and feature tracking for a vehicle safety dashboard."
}